'''
水仙花数:水仙花数也被称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数，它是一个3位数，
该数字每个位上数字的立方之和正好等于它本身，例如：$1^3 + 5^3+ 3^3=153$。

'''
# num = input('请输入一个三位数：')
# if len(num) != 3 :
#     print('请输入正确位数的数字!')
# else:
#     a = int(num[0:1])
#     b = int(num[1:2])
#     c = int(num[2:3])
#
#     if a**3 + b**3 + c**3 == int(num):
#         print('%s是水仙花数' % num)
#     else :
#         print('%s不是水仙花数' % num)
'''
找出所有的水仙花数
'''
# for x in range(100,1000):
#     a = x % 10           #取个位数字
#     b = x // 10 % 10     #取十位数字
#     c = x // 100          #取百位数字
#
#     if a**3 +b**3+c**3 == x :
#         print(x)
'''
正数反转例如，543 -> 345
'''
# num = int(input("请输入一个正数:"))
# res = 0
# while num > 0 :
#     res = res *10 + num % 10
#     num //= 10
#
# print('res=',res)
